app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE (LOWER(name) LIKE LOWER('%Game%'))
SELECT  "products".* FROM "products" LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "products"
---
 def index
    @products = if params[:search]
      # Product.where("name ILIKE ?", "%#{params[:search]}%").page(params[:page])
      Product.where("LOWER(name) LIKE LOWER(?)", "%#{params[:search]}%")
    else
      Product.all.page(params[:page])

INSERT INTO "products" ("name", "description", "price_in_cents", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @product = Product.new(product_params)

    if @product.save

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "products" SET "price_in_cents" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["price_in_cents", 95], ["updated_at", "2015-02-10 15:03:52.720697"], ["id", 5]]
---
  def update
    @product = Product.find(params[:id])

    if @product.update_attributes(product_params)