app/views/reviews/_review.html.erb

    <em> by <%= review.user.email %></em>
    Added on: <%= review.created_at %>
---
INSERT INTO "reviews" ("comment", "product_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "my first review for this product\r\n"], ["product_id", 31], ["user_id", 1], ["created_at", "2015-03-03 06:34:42.334883"], ["updated_at", "2015-03-03 06:34:42.334883"]]